## 955148791056: Satellite bucket
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 7 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.s3_replicate will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_replicate"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetReplicationConfiguration",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObjectVersion",
              + "s3:GetObjectVersionAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ObjectOwnerOverrideToBucketOwner",
              + "s3:ReplicateDelete",
              + "s3:ReplicateObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cbs-log-archive-339850311124/*",
            ]
        }
    }

  # aws_iam_policy.s3_replicate will be created
  + resource "aws_iam_policy" "s3_replicate" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CbsSatelliteReplicateToLogArchive"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.s3_replicate will be created
  + resource "aws_iam_role_policy_attachment" "s3_replicate" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "CbsSatelliteReplicateToLogArchive"
    }

  # aws_s3_bucket_ownership_controls.satellite_bucket will be created
  + resource "aws_s3_bucket_ownership_controls" "satellite_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.satellite_access_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cbs-satellite-955148791056-access"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "cbs-955148791056"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cbs-955148791056"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.satellite_access_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.satellite_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cbs-satellite-955148791056"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "cbs-955148791056"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cbs-955148791056"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "delete-old-objects"

          + expiration {
              + days = 14
            }
        }

      + logging {
          + target_bucket = (known after apply)
        }

      + replication_configuration {
          + role = "arn:aws:iam::955148791056:role/CbsSatelliteReplicateToLogArchive"

          + rules {
              + delete_marker_replication_status = "Enabled"
              + id                               = "cbs-log-archive"
              + priority                         = 100
              + status                           = "Enabled"

              + destination {
                  + account_id         = "339850311124"
                  + bucket             = "arn:aws:s3:::cbs-log-archive-339850311124"
                  + replica_kms_key_id = "arn:aws:kms:ca-central-1:339850311124:key/02bf26d4-b787-485e-91de-c36e5f0fcd91"

                  + access_control_translation {
                      + owner = "Destination"
                    }
                }

              + filter {}

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = true
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.satellite_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.s3_replicate"]

9 tests, 8 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
